Repository: k4d7h8-cyber/devicenote
Catalog: lib/l10n/app_*.arb
Languages: ur

# appTitle
source: DeviceNote
ur: ڈيوائس نوٹ

# bootPlaceholderMessage
source: Setup phase complete. Replace this screen with actual routes.
ur: سیٹ اپ مرحلہ مکمل ہو گیا۔ اسکرین کو اصل روٹس سے تبدیل کریں۔

# homeSettingsTooltip
source: Settings
ur: سیٹنگز

# homeSearchHint
source: Search
ur: تلاش

# homeNoDevices
source: No registered devices
ur: کوئی رجسٹرڈ ڈیوائس نہیں

# homeAddDeviceTooltip
source: Add device
ur: ڈیوائس شامل کریں

# homeDdayMonthsLabel
source: D-{months} m
ur: D-{months} ماہ

# settingsTitle
source: Settings
ur: سیٹنگز

# settingsNotificationsToggleTitle
source: Enable notifications
ur: اطلاعات فعال کریں

# settingsNotificationsToggleEnabled
source: Warranty reminders will follow your preferences.
ur: وارنٹی یاددہانی آپ کی ترجیحات پر عمل کریں گی۔

# settingsNotificationsToggleDisabled
source: Turn on to receive reminders before warranties expire.
ur: وارنٹی ختم ہونے سے پہلے یاددہانی حاصل کرنے کے لیے آن کریں۔

# settingsReminderTimeLabel
source: Reminder time
ur: یاددہانی کا وقت

# settingsLanguageTitle
source: Language
ur: زبان

# settingsLanguagePickerTitle
source: Choose language
ur: زبان منتخب کریں

# settingsBackupSectionTitle
source: Backup & Restore
ur: بیک اپ اور بحالی

# languageEnglish
source: English
ur: انگریزی

# languageKorean
source: Korean
ur: کورین

# commonBackup
source: Backup
ur: بیک اپ

# commonRestore
source: Restore
ur: بحال کریں

# commonVersion
source: Version
ur: ورژن

# commonSave
source: Save
ur: محفوظ کریں

# commonCancel
source: Cancel
ur: منسوخ کریں

# commonDelete
source: Delete
ur: حذف کریں

# commonEdit
source: Edit
ur: ترمیم کریں

# addDeviceSavedMessage
source: Saved.
ur: محفوظ ہو گیا۔

# addDevicePickImagesError
source: Failed to pick images: {error}
ur: تصاویر منتخب کرنے میں ناکام: {error}

# addDeviceEditTitle
source: Edit device
ur: ڈیوائس میں ترمیم کریں

# addDeviceCreateTitle
source: Register device
ur: ڈیوائس شامل کریں

# addDeviceCategoryLabel
source: Category
ur: زمرہ

# addDeviceCategoryRequired
source: Category is required
ur: زمرہ درکار ہے

# addDeviceModelNameLabel
source: Model name
ur: ماڈل کا نام

# addDeviceModelNameRequired
source: Model name is required
ur: ماڈل کا نام درکار ہے

# addDeviceBrandLabel
source: Brand
ur: برانڈ

# addDeviceBrandRequired
source: Brand is required
ur: برانڈ درکار ہے

# addDeviceModelNumberLabel
source: Model number
ur: ماڈل نمبر

# addDeviceModelNumberRequired
source: Model number is required
ur: ماڈل نمبر درکار ہے

# addDevicePurchaseDateLabel
source: Purchase date
ur: خریداری کی تاریخ

# addDevicePurchaseDateHint
source: Pick a date
ur: ایک تاریخ منتخب کریں

# addDevicePurchaseDateRequired
source: Pick a purchase date
ur: خریداری کی تاریخ منتخب کریں

# addDevicePurchaseDateFutureError
source: Purchase date cannot be in the future
ur: خریداری کی تاریخ مستقبل میں نہیں ہو سکتی

# addDeviceWarrantyLabel
source: Warranty (months)
ur: وارنٹی (ماہ)

# addDeviceWarrantyRequired
source: Warranty is required
ur: وارنٹی درکار ہے

# addDeviceDigitsOnly
source: Enter digits only
ur: صرف ہندسے درج کریں

# addDeviceWarrantyRange
source: Must be between 0 and 120
ur: 0 اور 120 کے درمیان ہونا چاہیے

# addDeviceCustomerCenterLabel
source: Customer center
ur: کسٹمر سینٹر

# addDeviceCustomerCenterHint
source: e.g. 1588-0000, 010-1234-5678
ur: جیسے 1588-0000, 010-1234-5678

# addDeviceCustomerCenterInvalid
source: Digits and - only
ur: صرف ہندسے اور -

# addDeviceOthersSectionTitle
source: Others
ur: دیگر

# addDeviceTakePhoto
source: Take photo
ur: تصویر کھینچیں

# addDeviceSelectFromGallery
source: Select from gallery
ur: گیلری سے منتخب کریں

# categoryTv
source: TV
ur: ٹی وی

# categoryWasher
source: Washer
ur: واشر

# categoryComputer
source: Computer
ur: کمپیوٹر

# categoryRefrigerator
source: Refrigerator
ur: ریفریجریٹر

# categoryAirConditioner
source: Air conditioner
ur: ایئر کنڈیشنر

# categoryCar
source: Car
ur: کار

# categoryOthers
source: Others
ur: دیگر

# deviceDetailTitle
source: Device detail
ur: ڈیوائس کی تفصیل

# deviceDetailNotFound
source: Device not found.
ur: ڈیوائس نہیں ملا۔

# deviceDetailCategoryLabel
source: Category
ur: زمرہ

# deviceDetailBrandLabel
source: Brand
ur: برانڈ

# deviceDetailModelNameLabel
source: Model name
ur: ماڈل کا نام

# deviceDetailModelNumberLabel
source: Model number
ur: ماڈل نمبر

# deviceDetailPurchaseDateLabel
source: Purchase date
ur: خریداری کی تاریخ

# deviceDetailWarrantyLabel
source: Warranty (months)
ur: وارنٹی (ماہ)

# deviceDetailCustomerCenterLabel
source: Customer center
ur: کسٹمر سینٹر

# deviceDetailNoContact
source: No customer center registered.
ur: کوئی کسٹمر سینٹر رجسٹرڈ نہیں ہے۔

# deviceDetailCallButton
source: Call {number}
ur: کال کریں {number}

# deviceDetailCallError
source: Unable to open the phone dialer.
ur: فون ڈائلر کھولنے میں ناکام۔

# deviceDetailNotificationsTitle
source: Warranty notifications
ur: وارنٹی کی اطلاعات

# deviceDetailNotificationsEnabled
source: Reminders will be sent until {expiry}.
ur: یاددہانی {expiry} تک بھیجی جائیں گی۔

# deviceDetailNotificationsDisabled
source: Turn on notifications in Settings to receive reminders.
ur: یاددہانی حاصل کرنے کے لیے سیٹنگز میں اطلاعات آن کریں۔

# deviceDetailPhotosSectionTitle
source: Photos
ur: تصاویر

# deviceDetailDeleteDialogTitle
source: Delete this device?
ur: اس ڈیوائس کو حذف کریں؟

# deviceDetailDeleteDialogMessage
source: This action cannot be undone.
ur: اس کارروائی کو کالعدم نہیں کیا جا سکتا۔

# notificationsGlobalEnabled
source: Warranty notifications enabled.
ur: وارنٹی کی اطلاعات فعال ہیں۔

# notificationsGlobalDisabled
source: Warranty notifications disabled.
ur: وارنٹی کی اطلاعات غیر فعال ہیں۔

# notificationsEnableInSettings
source: Enable notifications in Settings to schedule alerts.
ur: الرٹس کا شیڈول کرنے کے لیے سیٹنگز میں اطلاعات فعال کریں۔

# notificationsDeviceScheduled
source: Warranty reminders scheduled.
ur: وارنٹی یاددہانی شیڈول کی گئی ہیں۔

# notificationsDeviceExpired
source: Warranty period already ended.
ur: وارنٹی کی مدت پہلے ہی ختم ہو چکی ہے۔

# notificationsDeviceCancelled
source: Warranty reminders cancelled.
ur: وارنٹی یاددہانی منسوخ کر دی گئی ہیں۔

# notificationsPermissionTitle
source: Allow notifications?
ur: اطلاعات کی اجازت دیں؟

# notificationsPermissionDescription
source: Enable push notifications to receive warranty reminders for your devices.
ur: اپنے ڈیوائسز کے لیے وارنٹی یاددہانی حاصل کرنے کے لیے پش اطلاعات فعال کریں۔

# notificationsPermissionNotNow
source: Not now
ur: ابھی نہیں

# notificationsPermissionAllow
source: Allow
ur: اجازت دیں

# notificationsPermissionDenied
source: Notification permission denied.
ur: اطلاع کی اجازت مسترد کر دی گئی۔

# cameraCaptureFailed
source: Failed to capture photo: {error}
ur: تصویر لینے میں ناکام: {error}

# cameraTitle
source: Camera
ur: کیمرہ

# cameraInitializationFailed
source: Failed to initialize the camera.
ur: کیمرہ کو شروع کرنے میں ناکام۔
